performance-testing/results/20250927-202601/html-report/statistics.json
{
  "Get All Food Items" : {
    "transaction" : "Get All Food Items",
    "sampleCount" : 200,
    "errorCount" : 200,
    "errorPct" : 100.0,
    "meanResTime" : 1.8249999999999993,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.950000000000045,
    "throughput" : 3.592792857527799,
    "receivedKBytesPerSec" : 9.227583218064563,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 600,
    "errorCount" : 600,
    "errorPct" : 100.0,
    "meanResTime" : 1.9416666666666687,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 10.399154202124894,
    "receivedKBytesPerSec" : 26.708765187098116,
    "sentKBytesPerSec" : 0.0
  },
  "Search Food Items" : {
    "transaction" : "Search Food Items",
    "sampleCount" : 200,
    "errorCount" : 200,
    "errorPct" : 100.0,
    "meanResTime" : 1.89,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 3.5971869997661825,
    "receivedKBytesPerSec" : 9.2388689544776,
    "sentKBytesPerSec" : 0.0
  },
  "User Login" : {
    "transaction" : "User Login",
    "sampleCount" : 200,
    "errorCount" : 200,
    "errorPct" : 100.0,
    "meanResTime" : 2.1100000000000003,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.990000000000009,
    "throughput" : 3.597316401964135,
    "receivedKBytesPerSec" : 9.239201305825853,
    "sentKBytesPerSec" : 0.0
  }
}